<h1>ＡＴＲＳについて</h1>
<div id="top-information">
<ul>
  <li class="top-info-item">ATRS（本アプリケーション）は、Macchinetta オンライン版 フレームワーク（以下、フレームワーク）を用いたサンプルアプリケーションです。</li>

  <li class="top-info-item">ATRSのバージョンは、1.4.1です。</li>

  <li class="top-info-item">ATRSの利用方法について
    <ul>
      <li>ATRSにログインする場合は、お客さま番号とパスワードを入力の上、ログインボタンを押してください</li>

      <li>ATRSからログアウトする場合は、ログアウトボタンを押してください。</li>

      <li>フライトの空席状況を照会する場合は、予約/購入/変更メニューより空席照会予約を選択して空席照会状況入力へ進むか、本画面より搭乗日、区間、搭乗クラスを選択の上、照会ボタンを押してください。</li>

      <li>続けてチケットを予約する場合は、フライトの選択、お客様情報を入力した上で、予約内容の確認を行い、予約の確定を実施してください。</li>

      <li>ATRSカード会員に入会する場合は、ユーザ情報登録を選択してください。</li>

      <li>ATRSカード会員情報を変更する場合は、ログインした後、ユーザ情報変更を選択してください。</li>
    </ul>
  </li>
  <li class="top-info-item">ATRSに実装されているフレームワークの提供機能について
    <ul>
      <li>ATRSに実装されているフレームワークの機能については、サンプルアプリケーションマニュアルを参照してください。</li>
    </ul>
  </li>
</ul>
</div>
